tutorial/single_sphere/CFD/0/phiIB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phiIB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    x1
    {
        type            zeroGradient;
//        type            fixedValue;
//        value           uniform 0; 
    }

    walls
    {
        type            zeroGradient;
    }
    
    z2
    {
        type            zeroGradient;
    }

    x2
    {
//        type            fixedValue;
//        value           uniform 0;
        type            zeroGradient;
    }

}

// ************************************************************************* //
